docs: replace architecture diagram with ascii sketch
